HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(f32[])->f32[]}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.1 (args_0_.1: f32[]) -> f32[] {
  %args_0_.1 = f32[] parameter(0), metadata={op_name="args[0]"}
  ROOT %copy = f32[] copy(%args_0_.1)
}

